---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricArea.CoverOffset
source: html/d08480ca-f6c6-93ad-c5c4-a86e157a55eb.htm
---
# Autodesk.Revit.DB.Structure.FabricArea.CoverOffset Property

The additional cover offset of the fabric distribution.

## Syntax (C#)
```csharp
public double CoverOffset { get; set; }
```